#include <iostream>
#include <string>
using namespace std;
int main() {
    string students[10][3] = {
        {"Иванов", "Иван", "1"},
        {"Петров", "Петр", "2"},
        {"Сидоров", "Сидор", "3"},
        {"Козлов", "Андрей", "4"},
        {"Новиков", "Дмитрий", "5"},
        {"Морозов", "Алексей", "6"},
        {"Волков", "Михаил", "7"},
        {"Соколов", "Николай", "8"},
        {"Лебедев", "Сергей", "9"},
        {"Попов", "Владимир", "10"}
    };
    
    for (int i = 0; i < 10; i++) {
        cout << "Hello to 304 from " << students[i][0] << " " << students[i][1] << ", number " << students[i][2] << "!" << endl;
    }
    
    return 0;
}

