package main

import "fmt"

func main() {
    students := [][]string{
        {"Иванов", "Иван", "1"},
        {"Петров", "Петр", "2"},
        {"Сидоров", "Сидор", "3"},
        {"Козлов", "Андрей", "4"},
        {"Новиков", "Дмитрий", "5"},
        {"Морозов", "Алексей", "6"},
        {"Волков", "Михаил", "7"},
        {"Соколов", "Николай", "8"},
        {"Лебедев", "Сергей", "9"},
        {"Попов", "Владимир", "10"},
    }
    
    for _, student := range students {
        fmt.Printf("Hello to 304 from %s %s, number %s!\n", student[0], student[1], student[2])
    }
}

